**Pandas**

**it is used for datya analysis and it is the most important library for actuaries.It is like the best version of excel which has some amazing features**

1. series
2. data frame

# series

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels=['a','b','c','d']
new_list=[10,20,30,40]
new_array=np.array([20,30,40,50])
dict={'fruit':'mango','quantity':'30kgs','variety':'dashari'}

In [3]:
#first series
pd.Series(data=labels)

0    a
1    b
2    c
3    d
dtype: object

In [4]:
pd.Series(data=labels,index=new_list)

10    a
20    b
30    c
40    d
dtype: object

In [5]:
pd.Series(labels,new_array)

20    a
30    b
40    c
50    d
dtype: object

In [6]:
pd.Series(dict)

fruit         mango
quantity      30kgs
variety     dashari
dtype: object

In [7]:
#series from scratch
nominal_GDP=pd.Series(data=[25,15,8,5],index=("USA",'china','hungry','india'))

In [8]:
nominal_GDP

USA       25
china     15
hungry     8
india      5
dtype: int64

In [9]:
#real gdp is nominal - inflation
#creta real gdp 
real_GDP=pd.Series(data=[20,10,5,2.5],index=('USA','china','hungry','india'))

In [10]:
real_GDP

USA       20.0
china     10.0
hungry     5.0
india      2.5
dtype: float64

In [11]:
#inflation calculation
#inflation= nomianal-real
inflation=nominal_GDP-real_GDP

In [12]:
inflation

USA       5.0
china     5.0
hungry    3.0
india     2.5
dtype: float64

In [13]:
nominal_GDP['india']

5

# data frame

1. how to create a data frame
2. indexing and slicing

   A. how to select a column
   
     a. single column,multiple column
     
     b. adding a column , deleting a coloumn, do this permanently
   B. how to select a row
   
     a. loc and iloc method
     
     b. single rows , multiple rows
   c. how to specific rows and columns
   
3. filtering your data frame filtring based on conditions

   A. filtring based on numbers-single,multiple values
   
   B. filtering based on values-single , multiple values
   
4. index knowledge

   A. reset index
   
   B. set index
   
   c. multiple index
   
     a. crossection

In [14]:
from numpy.random import randn

In [15]:
#we will crete data frame
pd.DataFrame(data=randn(4,3))

          0         1         2
0 -0.422651 -0.399635 -1.354425
1  0.783760 -0.124426 -1.034673
2 -0.890073 -1.008810  1.235264
3  0.260362  1.731027  1.474625

In [16]:
df=pd.DataFrame(data=randn(4,3),index=['a','b','c','d'],columns=['x','y','z'])

In [17]:
df

          x         y         z
a -0.166409 -1.106290  0.050869
b -0.598395  0.673302 -1.909231
c -0.698391 -1.085456  1.322230
d  0.818763 -0.939791  2.655465

**indexing and slicing**

In [18]:
#single column
df['x']

a   -0.166409
b   -0.598395
c   -0.698391
d    0.818763
Name: x, dtype: float64

In [19]:
#multiple columns
df[['x','y']]

          x         y
a -0.166409 -1.106290
b -0.598395  0.673302
c -0.698391 -1.085456
d  0.818763 -0.939791

In [20]:
#add a column in existing data frame
df['name']=['kamal','bhavna','tejas','anu']

In [21]:
df

          x         y         z    name
a -0.166409 -1.106290  0.050869   kamal
b -0.598395  0.673302 -1.909231  bhavna
c -0.698391 -1.085456  1.322230   tejas
d  0.818763 -0.939791  2.655465     anu

In [22]:
df['new']=df['x']+df['y']+df['z']

In [23]:
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [24]:
df['new1']=df['x']*df['y']*df['z']

In [25]:
df

          x         y         z    name       new      new1
a -0.166409 -1.106290  0.050869   kamal -1.221831  0.009365
b -0.598395  0.673302 -1.909231  bhavna -1.834324  0.769230
c -0.698391 -1.085456  1.322230   tejas -0.461617  1.002347
d  0.818763 -0.939791  2.655465     anu  2.534437 -2.043291

In [26]:
#how to delete or drop a column
#axis=0 for rows and axis=1 for columns by default pandas take axis=0
df.drop('new1',axis=1)

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [27]:
df
#here we can see taht its not deleted paramnently

          x         y         z    name       new      new1
a -0.166409 -1.106290  0.050869   kamal -1.221831  0.009365
b -0.598395  0.673302 -1.909231  bhavna -1.834324  0.769230
c -0.698391 -1.085456  1.322230   tejas -0.461617  1.002347
d  0.818763 -0.939791  2.655465     anu  2.534437 -2.043291

In [28]:
# if we want to delete a column parmanent we have to use inplace=TRUE in data frame
df.drop('new1',axis=1,inplace=True)

In [29]:
df
#here its deleted paramnetly

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [30]:
# how to select rows
#loc (location)
#iloc (index location)

In [31]:
#loc
#loc-single row
df.loc['a']

x      -0.166409
y       -1.10629
z       0.050869
name       kamal
new    -1.221831
Name: a, dtype: object

In [32]:
#multiple rows
df.loc[['a','b']]

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324

In [33]:
#iloc
#single row
df.iloc[0]

x      -0.166409
y       -1.10629
z       0.050869
name       kamal
new    -1.221831
Name: a, dtype: object

In [34]:
#multiple rows
df.iloc[[0,2]]

          x         y         z   name       new
a -0.166409 -1.106290  0.050869  kamal -1.221831
c -0.698391 -1.085456  1.322230  tejas -0.461617

In [35]:
#if i have to extract a single row and column
df.loc['b','y']

0.6733018733116054

In [36]:
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [37]:
#for multiple rows and column
df.loc[['a','d'],['x','new']]

          x       new
a -0.166409 -1.221831
d  0.818763  2.534437

In [38]:
#selection with conditions
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [39]:
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [40]:
df[df['x']>0]

          x         y         z name       new
d  0.818763 -0.939791  2.655465  anu  2.534437

In [41]:
y=df[df['x']>0]['z']

In [42]:
y

d    2.655465
Name: z, dtype: float64

In [43]:
#for column selection we dont need loc and iloc

In [44]:
#multiple filter -numerical
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [45]:
df[df['x']<0]

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617

In [46]:
df[df['x']<-0.5]

          x         y         z    name       new
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617

In [47]:
#multiple filter
df[(df['x']<0.5)&df['z']<0.5]

          x         y         z name       new
d  0.818763 -0.939791  2.655465  anu  2.534437

In [48]:
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [49]:
df[(df['x']>0.5)|df['z']>0.5]

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [50]:
x=np.random.randint(1,100,12).reshape(4,3)

In [51]:
x

array([[96, 23, 38],
       [44,  3,  2],
       [50, 90, 72],
       [45, 65, 98]])

In [52]:
df1=pd.DataFrame(data=x,index='w x y z'.split(),columns=['A','B','C'])

In [53]:
df1

    A   B   C
w  96  23  38
x  44   3   2
y  50  90  72
z  45  65  98

In [54]:
df1['Regulations']=['LDTI','US GAAP','SOLVANCYII','IFRS17']

In [55]:
df1

    A   B   C Regulations
w  96  23  38        LDTI
x  44   3   2     US GAAP
y  50  90  72  SOLVANCYII
z  45  65  98      IFRS17

In [56]:
#single value
df1[df1['Regulations']=='US GAAP']

    A  B  C Regulations
x  44  3  2     US GAAP

In [57]:
#Multiple values
reg=['LDTI','IFRS17']

In [58]:
df1[df1['Regulations'].isin(reg)]

    A   B   C Regulations
w  96  23  38        LDTI
z  45  65  98      IFRS17

In [59]:
df

          x         y         z    name       new
a -0.166409 -1.106290  0.050869   kamal -1.221831
b -0.598395  0.673302 -1.909231  bhavna -1.834324
c -0.698391 -1.085456  1.322230   tejas -0.461617
d  0.818763 -0.939791  2.655465     anu  2.534437

In [60]:
df.reset_index()

  index         x         y         z    name       new
0     a -0.166409 -1.106290  0.050869   kamal -1.221831
1     b -0.598395  0.673302 -1.909231  bhavna -1.834324
2     c -0.698391 -1.085456  1.322230   tejas -0.461617
3     d  0.818763 -0.939791  2.655465     anu  2.534437

In [61]:
df['country name']=['USA','china','hungry','denmark']

In [62]:
df.set_index('country name',inplace=True)
#here we are setting our index as country name

In [63]:
df

                     x         y         z    name       new
country name
USA          -0.166409 -1.106290  0.050869   kamal -1.221831
china        -0.598395  0.673302 -1.909231  bhavna -1.834324
hungry       -0.698391 -1.085456  1.322230   tejas -0.461617
denmark       0.818763 -0.939791  2.655465     anu  2.534437

In [64]:
#multiple index crossection - xs
outer=['india','india','india','india','usa','usa','usa','usa']
inner=[1,2,3,4,1,2,3,4]

In [65]:
mytuple=list(zip(outer,inner))

In [66]:
mytuple

[('india', 1),
 ('india', 2),
 ('india', 3),
 ('india', 4),
 ('usa', 1),
 ('usa', 2),
 ('usa', 3),
 ('usa', 4)]

In [67]:
multi_index=pd.MultiIndex.from_tuples(mytuple)

In [68]:
df=pd.DataFrame(data=np.random.randn(8,2),index=multi_index,columns=['A','B'])

In [69]:
df

                A         B
india 1  1.166070  0.153917
      2  0.855794  0.759963
      3 -0.386484  0.386769
      4  1.428976 -1.677756
usa   1 -0.121802  0.272464
      2  0.270041 -0.442926
      3 -0.209244  0.233936
      4  0.518248 -1.491048

In [70]:
#index outer 
df.loc['india']

          A         B
1  1.166070  0.153917
2  0.855794  0.759963
3 -0.386484  0.386769
4  1.428976 -1.677756

In [71]:
df.loc['usa']

          A         B
1 -0.121802  0.272464
2  0.270041 -0.442926
3 -0.209244  0.233936
4  0.518248 -1.491048

In [72]:
df.loc['india']

          A         B
1  1.166070  0.153917
2  0.855794  0.759963
3 -0.386484  0.386769
4  1.428976 -1.677756

In [73]:
outer

['india', 'india', 'india', 'india', 'usa', 'usa', 'usa', 'usa']

In [74]:
inner

[1, 2, 3, 4, 1, 2, 3, 4]

In [75]:
import numpy as np

In [76]:
import seaborn as sns

In [77]:
df1

    A   B   C Regulations
w  96  23  38        LDTI
x  44   3   2     US GAAP
y  50  90  72  SOLVANCYII
z  45  65  98      IFRS17

In [78]:
df

                A         B
india 1  1.166070  0.153917
      2  0.855794  0.759963
      3 -0.386484  0.386769
      4  1.428976 -1.677756
usa   1 -0.121802  0.272464
      2  0.270041 -0.442926
      3 -0.209244  0.233936
      4  0.518248 -1.491048

In [79]:
# writing index
df.index.names=['country','zone']

In [80]:
df

                     A         B
country zone
india   1     1.166070  0.153917
        2     0.855794  0.759963
        3    -0.386484  0.386769
        4     1.428976 -1.677756
usa     1    -0.121802  0.272464
        2     0.270041 -0.442926
        3    -0.209244  0.233936
        4     0.518248 -1.491048

In [81]:
#crossection xs
df.xs('india')

             A         B
zone
1     1.166070  0.153917
2     0.855794  0.759963
3    -0.386484  0.386769
4     1.428976 -1.677756

In [82]:
#how to extract value of zone 1 of both india and usa
df.xs(key=1,level='zone')

                A         B
country
india    1.166070  0.153917
usa     -0.121802  0.272464